qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/AT32/AT32F40x/at32f40x.h
/** @addtogroup Exported_types
  * @{
  */

typedef int32_t  INT32;
typedef int16_t  INT16;
typedef int8_t   INT8;
typedef uint32_t UINT32;
typedef uint16_t UINT16;
typedef uint8_t  UINT8;

typedef int32_t  s32;
typedef int16_t  s16;
typedef int8_t   s8;

typedef const int32_t sc32;   /*!< read only */
typedef const int16_t sc16;   /*!< read only */
typedef const int8_t  sc8;    /*!< read only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;    /*!< read only */
typedef __I int16_t vsc16;    /*!< read only */
typedef __I int8_t  vsc8;     /*!< read only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /*!< read only */
typedef const uint16_t uc16;  /*!< read only */
typedef const uint8_t  uc8;   /*!< read only */

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;   /*!< read only */
typedef __I uint16_t vuc16;   /*!< read only */
typedef __I uint8_t  vuc8;    /*!< read only */

/**
  * @brief flag status
  */
typedef enum {RESET = 0, SET = !RESET} flag_status;

/**
  * @brief error status
  */
typedef enum {ERROR = 0, SUCCESS = !ERROR} error_status;

/**
  * @}
  */

/** @addtogroup Exported_macro
  * @{
  */

#define REG8(addr)                       *(volatile uint8_t *)(addr)
#define REG16(addr)                      *(volatile uint16_t *)(addr)
#define REG32(addr)                      *(volatile uint32_t *)(addr)

#define MAKE_VALUE(reg_offset, bit_num)  (uint32_t)(((reg_offset) << 16) | (bit_num & 0x1F))

#define PERIPH_REG(periph_base, value)   REG32((periph_base + (value >> 16)))
#define PERIPH_REG_BIT(value)            (0x1U << (value & 0x1F))

/**
  * @}
  */
/******************  Bit definition for CRM_CTRL register  *****************/
#define CRM_CTRL_HICKEN                  (0x1U << 0)
#define CRM_CTRL_HICKSTBL                (0x1U << 1)
#define CRM_CTRL_HICKTRIM                (0x3FU << 2)
#define CRM_CTRL_HEXTEN                  (0x1U << 16)
#define CRM_CTRL_HEXTSTBL                (0x1U << 17)
#define CRM_CTRL_HEXTBYPS                (0x1U << 18)
#define CRM_CTRL_CFDEN                   (0x1U << 19)
#define CRM_CTRL_PLLEN                   (0x1U << 24)
#define CRM_CTRL_PLLSTBL                 (0x1U << 25)

/******************  Bit definition for CRM_CFG register  ******************/
#define CRM_CFG_SCLKSEL                  (0x3U << 0)
#define CRM_CFG_SCLK_HICK                (0x0U << 0)
#define CRM_CFG_SCLK_HEXT                (0x1U << 0)
#define CRM_CFG_SCLK_PLL                 (0x2U << 0)
#define CRM_CFG_SCLKSTS                  (0x3U << 2)
#define CRM_CFG_SCLKSTS_HICK             (0x0U << 2)
#define CRM_CFG_SCLKSTS_HEXT             (0x1U << 2)
#define CRM_CFG_SCLKSTS_PLL              (0x2U << 2)

/*****************  Bit definition for CRM_APB2RST register  ***************/
#define CRM_APB2RST_IOMUXRST             (0x1U << 0)
#define CRM_APB2RST_EXINTRST             (0x1U << 1)
#define CRM_APB2RST_GPIOARST             (0x1U << 2)
#define CRM_APB2RST_GPIOBRST             (0x1U << 3)
#define CRM_APB2RST_GPIOCRST             (0x1U << 4)
#define CRM_APB2RST_GPIODRST             (0x1U << 5)
#define CRM_APB2RST_GPIOERST             (0x1U << 6)
#define CRM_APB2RST_ADC1RST              (0x1U << 9)
#define CRM_APB2RST_ADC2RST              (0x1U << 10)
#define CRM_APB2RST_TMR1RST              (0x1U << 11)
#define CRM_APB2RST_SPI1RST              (0x1U << 12)
#define CRM_APB2RST_TMR8RST              (0x1U << 13)
#define CRM_APB2RST_USART1RST            (0x1U << 14)
#define CRM_APB2RST_ADC3RST              (0x1U << 15)
#define CRM_APB2RST_TMR9RST              (0x1U << 19)
#define CRM_APB2RST_TMR10RST             (0x1U << 20)
#define CRM_APB2RST_TMR11RST             (0x1U << 21)
#define CRM_APB2RST_ACCRST               (0x1U << 22)
#define CRM_APB2RST_I2C3RST              (0x1U << 23)
#define CRM_APB2RST_USART6RST            (0x1U << 24)
#define CRM_APB2RST_UART7RST             (0x1U << 25)
#define CRM_APB2RST_UART8RST             (0x1U << 26)

/*****************  Bit definition for CRM_APB1RST register  ***************/
#define CRM_APB1RST_TMR2RST              (0x1U << 0)
#define CRM_APB1RST_TMR3RST              (0x1U << 1)
#define CRM_APB1RST_TMR4RST              (0x1U << 2)
#define CRM_APB1RST_TMR5RST              (0x1U << 3)
#define CRM_APB1RST_TMR6RST              (0x1U << 4)
#define CRM_APB1RST_TMR7RST              (0x1U << 5)
#define CRM_APB1RST_TMR12RST             (0x1U << 6)
#define CRM_APB1RST_TMR13RST             (0x1U << 7)
#define CRM_APB1RST_TMR14RST             (0x1U << 8)
#define CRM_APB1RST_WWDTRST              (0x1U << 11)
#define CRM_APB1RST_SPI2RST              (0x1U << 14)
#define CRM_APB1RST_SPI3RST              (0x1U << 15)
#define CRM_APB1RST_SPI4RST              (0x1U << 16)
#define CRM_APB1RST_USART2RST            (0x1U << 17)
#define CRM_APB1RST_USART3RST            (0x1U << 18)
#define CRM_APB1RST_UART4RST             (0x1U << 19)
#define CRM_APB1RST_UART5RST             (0x1U << 20)
#define CRM_APB1RST_I2C1RST              (0x1U << 21)
#define CRM_APB1RST_I2C2RST              (0x1U << 22)
#define CRM_APB1RST_USBRST               (0x1U << 23)
#define CRM_APB1RST_CAN1RST              (0x1U << 25)
#define CRM_APB1RST_CAN2RST              (0x1U << 26)
#define CRM_APB1RST_BPRRST               (0x1U << 27)
#define CRM_APB1RST_PWCRST               (0x1U << 28)
#define CRM_APB1RST_DACRST               (0x1U << 29)

/******************  Bit definition for CRM_AHBEN register  ****************/
#define CRM_AHBEN_DMA1EN                 (0x1U << 0)
#define CRM_AHBEN_DMA2EN                 (0x1U << 1)
#define CRM_AHBEN_SRAMEN                 (0x1U << 2)
#define CRM_AHBEN_FLASHEN                (0x1U << 4)
#define CRM_AHBEN_CRCEN                  (0x1U << 6)
#define CRM_AHBEN_XMCEN                  (0x1U << 8)
#define CRM_AHBEN_SDIO1EN                (0x1U << 10)
#define CRM_AHBEN_SDIO2EN                (0x1U << 11)
#define CRM_AHBEN_EMACEN                 (0x1U << 14)
#define CRM_AHBEN_EMACTXEN               (0x1U << 15)
#define CRM_AHBEN_EMACRXEN               (0x1U << 16)
#define CRM_AHBEN_EMACPTPEN              (0x1U << 28)

/*****************  Bit definition for CRM_APB2EN register  ****************/
#define CRM_APB2EN_IOMUXEN               (0x1U << 0)
#define CRM_APB2EN_EXINTEN               (0x1U << 1)
#define CRM_APB2EN_GPIOAEN               (0x1U << 2)
#define CRM_APB2EN_GPIOBEN               (0x1U << 3)
#define CRM_APB2EN_GPIOCEN               (0x1U << 4)
#define CRM_APB2EN_GPIODEN               (0x1U << 5)
#define CRM_APB2EN_GPIOEEN               (0x1U << 6)
#define CRM_APB2EN_ADC1EN                (0x1U << 9)
#define CRM_APB2EN_ADC2EN                (0x1U << 10)
#define CRM_APB2EN_TMR1EN                (0x1U << 11)
#define CRM_APB2EN_SPI1EN                (0x1U << 12)
#define CRM_APB2EN_TMR8EN                (0x1U << 13)
#define CRM_APB2EN_USART1EN              (0x1U << 14)
#define CRM_APB2EN_ADC3EN                (0x1U << 15)
#define CRM_APB2EN_TMR9EN                (0x1U << 19)
#define CRM_APB2EN_TMR10EN               (0x1U << 20)
#define CRM_APB2EN_TMR11EN               (0x1U << 21)
#define CRM_APB2EN_ACCEN                 (0x1U << 22)
#define CRM_APB2EN_I2C3EN                (0x1U << 23)
#define CRM_APB2EN_USART6EN              (0x1U << 24)
#define CRM_APB2EN_UART7EN               (0x1U << 25)
#define CRM_APB2EN_UART8EN               (0x1U << 26)

